TestEDT/src/Enums/уа_КлассификацияЦБ/уа_КлассификацияЦБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_КлассификацияЦБ</name>
  <enumValues>
    <name>РФ</name>
  </enumValues>
  <enumValues>
    <name>СубъектовРФ</name>
  </enumValues>
  <enumValues>
    <name>КредитныхОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ПрочихРезидентов</name>
  </enumValues>
  <enumValues>
    <name>ИностранныхГосударств</name>
  </enumValues>
  <enumValues>
    <name>БанковНерезидентов</name>
  </enumValues>
  <enumValues>
    <name>ПрочихНерезидентов</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_КатегорииАктива/уа_КатегорииАктива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_КатегорииАктива</name>
  <enumValues>
    <name>Акция</name>
  </enumValues>
  <enumValues>
    <name>Облигация</name>
  </enumValues>
  <enumValues>
    <name>Пай</name>
  </enumValues>
  <enumValues>
    <name>ДепозитарнаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ИпотечныйСертификатУчастия</name>
  </enumValues>
  <enumValues>
    <name>Вексель</name>
  </enumValues>
  <enumValues>
    <name>Опцион</name>
  </enumValues>
  <enumValues>
    <name>Фьючерс</name>
  </enumValues>
  <enumValues>
    <name>СВОП</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_КлассификацияЦБ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НайтиПоКоду(Идентификатор) Экспорт
	КлассификацияЦБ = Неопределено;
	Если Идентификатор = "BON1" Тогда
		КлассификацияЦБ = Перечисления.уа_КлассификацияЦБ.РФ;
	ИначеЕсли Идентификатор = "BON2" Тогда
		КлассификацияЦБ	= Перечисления.уа_КлассификацияЦБ.СубъектовРФ;
	ИначеЕсли Идентификатор = "BON3" Или Идентификатор = "SHS1" Или Идентификатор = "SHS2" Тогда
		КлассификацияЦБ = Перечисления.уа_КлассификацияЦБ.КредитныхОрганизаций;
	ИначеЕсли Идентификатор = "BON4" Или Идентификатор = "SHS3" Или Идентификатор = "SHS4" Или Идентификатор = "SHS8" Тогда
		КлассификацияЦБ = Перечисления.уа_КлассификацияЦБ.ПрочихРезидентов;
	ИначеЕсли Идентификатор = "BON5" Тогда
		КлассификацияЦБ = Перечисления.уа_КлассификацияЦБ.ИностранныхГосударств;
	ИначеЕсли Идентификатор = "BON6" Или Идентификатор = "SHS5" Тогда
		КлассификацияЦБ = Перечисления.уа_КлассификацияЦБ.БанковНерезидентов;
	ИначеЕсли Идентификатор = "BON7" Или Идентификатор = "SHS6" Или Идентификатор = "SHS7" Тогда
		КлассификацияЦБ = Перечисления.уа_КлассификацияЦБ.ПрочихНерезидентов;
	КонецЕсли; 
	
	Возврат КлассификацияЦБ;
	
КонецФункции

// Определяет возможные классификации для категории ЦБ.
//
// Параметры:
//  КатегорияЦБ - ПеречислениеСсылка.УПЦБКатегорииЦБ - категория ЦБ.
//
// Возвращаемое значение:
//  ФиксированныйМассив - массив возможных классификаций.
//
Функция КлассификацииПоКатегорииЦБ(КатегорияЦБ) Экспорт
	
	КлассификацииЦБ = Новый Массив;
	Классификация = Перечисления.уа_КлассификацияЦБ;
	Если КатегорияЦБ = Перечисления.уа_КатегорииАктива.Акция Или 
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.Пай Или 
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.ДепозитарнаяРасписка Или 
		КатегорияЦБ = Перечисления.уа_КатегорииАктива.ИпотечныйСертификатУчастия Тогда
		
		КлассификацииЦБ.Добавить(Классификация.КредитныхОрганизаций);
		КлассификацииЦБ.Добавить(Классификация.ПрочихРезидентов);
		КлассификацииЦБ.Добавить(Классификация.БанковНерезидентов);
		КлассификацииЦБ.Добавить(Классификация.ПрочихНерезидентов);
		
	ИначеЕсли КатегорияЦБ = Перечисления.уа_КатегорииАктива.Облигация Тогда
		
		КлассификацииЦБ.Добавить(Классификация.РФ);
		КлассификацииЦБ.Добавить(Классификация.СубъектовРФ);
		КлассификацииЦБ.Добавить(Классификация.КредитныхОрганизаций);
		КлассификацииЦБ.Добавить(Классификация.ПрочихРезидентов);
		КлассификацииЦБ.Добавить(Классификация.ИностранныхГосударств);
		КлассификацииЦБ.Добавить(Классификация.БанковНерезидентов);
		КлассификацииЦБ.Добавить(Классификация.ПрочихНерезидентов);
		
	ИначеЕсли КатегорияЦБ = Перечисления.уа_КатегорииАктива.Вексель Тогда
		
		КлассификацииЦБ.Добавить(Классификация.РФ);
		КлассификацииЦБ.Добавить(Классификация.СубъектовРФ);
		КлассификацииЦБ.Добавить(Классификация.КредитныхОрганизаций);
		КлассификацииЦБ.Добавить(Классификация.ПрочихРезидентов);
		КлассификацииЦБ.Добавить(Классификация.ИностранныхГосударств);
		КлассификацииЦБ.Добавить(Классификация.БанковНерезидентов);
		КлассификацииЦБ.Добавить(Классификация.ПрочихНерезидентов);
				
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(КлассификацииЦБ);
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
